[["Character of the New Man", "<p data-block-key=\"qwnx8\">&quot;Therefore, put to death your members which are on the earth…put off all these:<br/>anger, wrath, malice, blasphemy, filthy language out of your mouth.&quot;<br/><b>Col. 3:5-8</b></p><p data-block-key=\"7a7kf\"></p><p data-block-key=\"9n85s\">The character of the ‘new man’ stands in clear contrast to the ‘old man’! We, in our old lives, lived like the rest of the lost and dying world. The things of this world were more important! Now, we must liver differently, or the watching world will reject the very faith we claim to have!</p>", "2022-02-13T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Born-Again-Christian.png"], ["Seasons of Prayer and Fasting", "<p data-block-key=\"cmfxz\">…the fast that I have chosen: to loose the bonds of wicked, to undo the heavy burdens, to let the oppressed go free, and that you break every yoke…<br/><b>Isaiah 58:6</b></p><p data-block-key=\"12ncm\"></p><p data-block-key=\"fvkqj\">Seasons of prayer and fasting can be physically and spiritually productive and life changing! Just read the verse about all that is accomplished: loose bonds, ease burdens, free the oppressed, break the yoke… Wow!</p>", "2022-02-20T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/R_1.jpeg"], ["Faith By My Works", "<p data-block-key=\"jv2wg\">I will show you my faith by my works…</p><p data-block-key=\"1mlbn\">James 2:18</p><p data-block-key=\"761t9\"></p><p data-block-key=\"17gcq\">In 1965 IBM had just produced the primitive ‘ancestor’ of the personal computer, but did nothing with it for years! Seems crazy!</p><p data-block-key=\"9kpd3\">We, however, do the same thing when talk ad nauseum about faith but actually do nothing.</p><p data-block-key=\"fr35s\">The beauty of what the Holy Spirit is speaking to us in the book of James about faith and works is found in being doers of the Word, not just being people who hear and babble about it.</p><p data-block-key=\"2fv42\"></p>", "2022-02-27T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/7711866066_9ffdaf3078_b.jpg"], ["Meditation and Memorization of the Word of God", "<p data-block-key=\"lkhyv\">Psalm 119:11 says, &quot;Your word I have hidden in my heart, that I might not sin against You.&quot;</p><p data-block-key=\"ain8c\"></p><p data-block-key=\"60pbv\">During this time when the world seems turned upside down, and every where we turn we see conflict, it is essential that we take the time, as Bill Johnson says, &quot;to meditate on the Word and give ourselves every opportunity to remember what is true.&quot; The meditation and memorization of the Word of God is a spiritual discipline that needs revival in our lives!</p>", "2022-03-06T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/R.jpeg"], ["But The Greatest of These is Love", "<p data-block-key=\"ojav1\">And now abide faith, hope, love, these three; but the greatest of these is love. 1 Cor. 13:13 </p><p data-block-key=\"2io0h\">An old favorite comic strip, Peanuts, written by Charles Schulz offered a lot more than laughter. Time and again I found solid theology written by the comedian cartoonist. A favorite one was Lucy and Linus: Lucy says &quot;You a doctor! Ha! That’s a big laugh! You could never be a doctor! You know why? Because you don’t love mankind, that’s why!&quot; Linus responds &quot;I LOVE MANKIND… IT&#x27;S PEOPLE I CAN’T STAND!&quot;</p><p data-block-key=\"1g1pv\">When you have a moment, read all of 1 Cor. chapter 13. And remember, we won’t be any good as a &#x27;clanging cymbal&#x27;. A genuine demonstration of agape love is what moves a lost and dying world. </p>", "2022-03-13T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/love.jpeg"], ["God The Provider", "<p data-block-key=\"cb4q7\">And my God shall supply all your need according to His riches in glory by Christ Jesus. Philippians 4:19</p><p data-block-key=\"4agte\">Allow me to share a little more Charles Schulz theology with you today.  In one of his Peanuts comic strips, Snoopy looks at his water dish, and says “Empty! And I’m dying of thirst!” Then he picks up the dish in his mouth and for several squares is running over to the water faucet where he waits, but nothing comes out. Then, without notice, it starts raining, then raining harder. Snoopy takes the dish, sets it down, gets a drink and in the last square he is lying on his dog house saying &quot;That’s one I’m going to have to think about for a while.&quot;</p><p data-block-key=\"29fvm\">We are like that sometimes; God provides in so many ways and we are left in awe and wonder. </p>", "2022-03-20T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/snoopy.jpg"], ["Beauty for Ashes", "<p data-block-key=\"cxqhf\">But what things were gain to me, these I have counted loss for Christ. Yet indeed I also count all things loss for the excellence of the knowledge of Christ Jesus my Lord, for whom I have suffered the loss of all things, and count them as rubbish, that I may gain Christ. Philippians 3:7-8</p><p data-block-key=\"3jgv6\">Shakespeare captures part of this idea in these lines: “But whate’er I be, nor I, nor any man that but man is, with nothing shall be pleased till he be eased with being nothing.”</p><p data-block-key=\"7quad\">In a Peanuts comic strip Charlie Brown is complaining about “another ball game lost, good grief.” Lucy says “Look at it this way Charlie Brown, we learn more from losing than we do from winning.” He responds with his mouth wide open “THAT MAKES ME THE SMARTEST PERSON IN THE WORLD”.</p><p data-block-key=\"llk2\">In the world of faith, the things we count for loss are exchanged for the excellence of the knowledge of Christ Jesus! Like receiving beauty for ashes as Isaiah 61:3 says.</p>", "2022-04-03T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/beauty-for-ashes.jpg"], ["Sunday is on the Way", "<p data-block-key=\"gde3t\">…they led Him away,… And when they had come to the place called Calvary, there they crucified Him… Luke 23:26, 33</p><p data-block-key=\"18uv8\">Now it was about the sixth hour, and there was darkness over all the earth until the ninth hour. Then the sun was darkened, and the veil of the temple was torn in two. Lk. 23:44-45</p><p data-block-key=\"fi87h\">It was a sad, dark day. Perhaps the saddest in human history. Doubtless it was a Friday of sorrow and pain, of weeping and broken hearts.</p><p data-block-key=\"9jchg\">Yes, it was Friday: but Sunday is on the way!</p><p data-block-key=\"f304n\">Up until that point, no one really understood. No one had the faith to believe what Christ said was necessary, and what would happen. This day had pain and suffering enough to go around.</p><p data-block-key=\"f0l03\"><b>Ah, but Sunday. Sunday is on the way!</b></p>", "2022-04-10T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/crosses.jpeg"], ["The Empty Tomb Says It All", "<p data-block-key=\"cxebt\">That I may know Him and the power of His resurrection, and the fellowship of His sufferings, being conformed to His death, if, by any means, I may attain to the resurrection from the dead. Philippians 3:10-11</p><p data-block-key=\"1ul58\"></p><p data-block-key=\"f64fe\">When we baptize a person in water, fully immersed in the water, they are identifying with the DEATH, BURIAL AND RESURRECTION OF JESUS CHRIST. We should know the power of His resurrection. And remember that the empty tomb says it all!</p>", "2022-04-17T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/empty-tomb.jpeg"], ["Effective, Fervent Prayer", "<p data-block-key=\"qh8l0\">Is anyone among you suffering? Let him pray. Is anyone cheerful? Let him sing psalms. Is anyone among you sick? Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord. And the prayer of faith will save the sick, James 5:13-15a </p><p data-block-key=\"bm2bd\">It is not overstated to say that PRAYER changes everything! Verse 16 says that &quot;the effective, fervent prayer of a righteous man avails much.&quot;</p><p data-block-key=\"6lob2\">Once again, this coming Friday and Saturday, April 29-30, from noon until noon, we will have constant prayer in the sanctuary. Twenty-four hours of prayer for the nation, for the community and for the church family. The sign-up sheet is on the table in the foyer.  </p>", "2022-04-24T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/THE-EFFECTUAL-FERVENT-PRAYER-BANNER.jpg"], ["Listening is a Skill", "<p data-block-key=\"q0os3\">Psalm 34:11 - Come, you children, listen to me; I will teach you the fear of the Lord.</p><p data-block-key=\"8v4lr\">Listening is a skill! Quite frankly it is one that many are lacking. Oftentimes, when we do not listen well to others in our lives, we lack the ability to listen when the Lord desires to speak with us.</p><p data-block-key=\"5cmgr\">Some of the instruction I gave for those participating in the twenty-four hours of prayer without ceasing was to also take time to be quiet before the Lord, and listen! </p>", "2022-05-01T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/bigstock-White-clock-with-words-Time-to-24719780.jpg"], ["Honor Your Father and Mother", "<p data-block-key=\"3byca\">Honor your father and your mother, that your days may be long upon the land which the Lord your God is giving you. Ex. 20:12 </p><p data-block-key=\"5dvut\">There are many ways to show HONOR! One way that we do this is by setting aside a special day, once a year: called Mother’s Day. My prayer is that every mother in this congregation be blessed and honored today! </p><p data-block-key=\"efkvj\"> </p><p data-block-key=\"bcibh\">If life has taught me anything, it is that we cannot take tomorrow for granted! Therefore, don’t just honor your mother today, but look for opportunities every day! Take advantage of the time, you will never regret it! </p>", "2022-05-08T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/mothers.png"], ["Spiritual Inheritance", "<p data-block-key=\"ju4uu\">And Enoch walked with God; and he was not, for God took him.  Gen. 5:24</p><p data-block-key=\"1jk2a\">By faith Enoch was taken away so that he did not see death, and was not found, because God had taken him; for before he was taken, he had a testimony, that he pleased God.  Heb. 11:5</p><p data-block-key=\"e3hlj\">When we think about leaving something for our children, often our thoughts go to money or possessions: an inheritance. However, I believe that there is something many times better than these!</p><p data-block-key=\"lpm7\">Enoch left a spiritual inheritance that was amazing! If we leave such an inheritance behind, it will not happen by accident.  </p>", "2022-05-15T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/inherit.png"], ["Where Hour Treasure is, There is Your heart", "<p data-block-key=\"ajed2\">For where your treasure is, there your heart will be also. NKJV Matthew 6:21</p><p data-block-key=\"6jl55\">On Wednesdays we are studying the Seven Deadly Sins; and last week it was the sin of Greed. How easy it is to trust money and forget about the blessings of God!</p><p data-block-key=\"fp307\">Something that serves as a good reminder in avoiding the sin of greed is to remember that there are things better than money! Good health is better! A clear conscience is better! A cultivated, moral intelligence is better! A happy home is better! It is possible to be happy without money; but without these money just becomes deceitful.</p><p data-block-key=\"8m6i2\">Lord, help us learn to be content, walk honorably and keep a clear conscience. </p>", "2022-05-23T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/heart.jpeg"], ["Recipe for Failure or Success", "<p data-block-key=\"znn0j\">So they carried the arc of God on a new cart…    1 Chronicles 13:7</p><p data-block-key=\"58k43\">King David made two attempts to bring the arc of God to Jerusalem; the first one was a disaster, and the second attempt was a success. What made the difference?</p><p data-block-key=\"6sa3u\">God gave instructions on exactly how the arc was to be moved. The priests and Levites had this information (at least they should have known); and David could have/should have consulted with the priests about this. The priests didn’t speak up and David didn’t inquire: there is your recipe for failure!</p><p data-block-key=\"e3bd1\">In His Word, God gives us an extreme amount of help and wisdom: take a look!</p>", "2022-05-29T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/success_failure1.jpg"], ["Less of Me and More of You", "<p data-block-key=\"kkjey\">when pride comes, then comes shame; but with the humble is wisdom. Proverbs 11:2</p><p data-block-key=\"98p1s\">John Milton, in his Christian Classic PARADISE LOST, writes of Satan “Better to reign in hell then serve in heaven.” This statement is the personification of pride!</p><p data-block-key=\"5r8u2\">If you want to try and do things on your own, God will let you. You won’t enjoy it much, but maybe we can sell popcorn.</p><p data-block-key=\"b0bll\">If you understand HUMILITY; you can say “Lord, less of me and more of You, please.”</p>", "2022-06-05T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/humility.jpg"], ["Envy's Disastrous Children", "<p data-block-key=\"bmgi7\">Love suffers long and is kind; love does not envy…   1 Corinthians 14:4</p><p data-block-key=\"fovu8\">The fourth of the seven deadly sins: ENVY has some disastrous children, like anger and murder. Just consider Cain and Abel in Genesis 4.</p><p data-block-key=\"49cvq\">Proverbs 14:30 says that “envy is rottenness to the bones.” Wow! What a warning!</p><p data-block-key=\"94j1t\">Proverbs 3:31 says “Do not envy the oppressor, and choose none of his ways.”</p>", "2022-06-12T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/envy.jpg"], ["Emulating God the Father", "<p data-block-key=\"8xjdi\">And you, fathers, do not provoke your children to wrath, but bring them up in the training and admonition of the Lord.    Ephesians 6:4</p><p data-block-key=\"9u2l2\">There are many of us who did not have a godly, earthly father; and perhaps some of us didn’t know our fathers at all.</p><p data-block-key=\"4hc93\">There are few greater rewards in this life than learning to be the best godly father you can be: you will never regret it!</p><p data-block-key=\"jhb1\">God’s Word will show you what to do, how to love, and how to ask for forgiveness. </p>", "2022-06-19T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/fathers-day.jpg"], ["Glorify the Lord with Service", "<p data-block-key=\"wixy9\">So we built the wall,…for the people had a mind to work. Nehemiah 4:6</p><p data-block-key=\"fkhev\">Whether we seal a parking lot, paint a fireside room, add a bathroom to the fellowship hall or refurbish the foyer, it all is a work of the people of the church. Prayer and giving and encouraging as well as putting your hands to the actual work is team work! And each team member is appreciated so much. Thank you! </p><p data-block-key=\"4e40m\">May our work glorify the Lord and serve as a refreshing, warm welcome to those visiting and looking for a place to worship! </p>", "2022-06-26T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/2589778729_7bb022ecea_b.jpg"], ["Curve Ball", "<p data-block-key=\"aryj6\">Matthew 8:24 - And suddenly a great tempest arose on the sea, so that the boat was covered with the waves. But He was asleep.</p><p data-block-key=\"dslgt\">There are many things that catch us by surprise, they happen suddenly or are just unexpected. The game of baseball changed like that, and specifically, in 1863, the ‘curve ball’ was added to the game. What a surprise it must have been.  Kind of like some of the curves life throws at us today. </p><p data-block-key=\"9p5k\">If you want to stay in the game, you learn to deal with the curve balls.</p>", "2022-07-10T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/5444096544_b0128da571_b.webp"], ["Vacation Bible School Starting Today!", "<p data-block-key=\"xq5vv\">But Jesus said, &quot;let the little children come to Me, and do not forbid them; for of such is the kingdom of heaven.&quot; Matthew 19:14</p><p data-block-key=\"bkl82\">This Sunday afternoon we are starting our VBS - Vacation Bible School! One of the best ways you can help us now is in prayer! </p><p data-block-key=\"bmcje\">The goal is simple: minister to children in the community, and build a relationship with their parents. Pray with us for a harvest of young souls!</p>", "2022-07-17T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/haydat.png"], ["Power Over Sin", "<p data-block-key=\"gunm3\">Oh, wretched man that I am, who will deliver me from this body of death? I thank God through Jesus Christ our Lord! Romans 7:24-25 </p><p data-block-key=\"6dgo0\">No one would question the fact that the Apostle Paul was a mature believer in Christ. Still, his testimony about life and struggles was extremely transparent! He never pretended to be the super spiritual “I never have any trials” kinda guy. He was real! What’s more, he understood that our true strength comes from the Lord Jesus Christ!</p><p data-block-key=\"2j140\">We have been given power over sin, and we should take every advantage of it! </p>", "2022-07-25T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/131210_Blog_powerofGod.jpg"], ["Improve Your Serve", "<p data-block-key=\"jl19f\">Just as the Son of Man did not come to be served, but to serve… Matt. 20:28 </p><p data-block-key=\"1u9jj\">You will not IMPROVE your “serve” by  making excuses or avoiding opportunities to serve others. These all served while others might have used their excuse not to: Abraham was old, but served. Joseph was abused, but served. Moses stuttered, but served. Gideon was afraid, but served. Peter had a temper, but served. Martha worried a lot, but served. Do you get the idea?</p><p data-block-key=\"1o8qm\">We can all improve our ‘serve’! Let’s do it today! </p>", "2022-07-31T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/service1.png"], ["Prince of Peace", "<p data-block-key=\"qc96w\">For He Himself is our peace, who has made both one, and has broken down the middle wall of separation. Eph. 2:14</p><p data-block-key=\"6srgj\">In an interview with Larry King, Harrison Ford was asked: “Your money has bought you so much; Is there anything you haven’t been able to buy?” Harrison said, “I don’t have peace.” Truly stated, peace is NOT something that you can buy! But if we will test our allegiance to the Lord, our answers can bring us peace. William Gurnall, a Puritan writer, asks these questions:</p><p data-block-key=\"ceu3h\">First: How did your ‘prince’ come to the throne? In this fallen world, we must ask Christ to sit on the throne of our hearts!</p><p data-block-key=\"e963n\">Second: Whose law do you obey? Because the prince of darkness has only the law of sin. The Prince of Peace has the law of life and holiness! (See Romans 6:16).</p><p data-block-key=\"7lpjs\">Third: Where do you go for protection? When you live in sin and are unrepentant, you won’t trust God and go to Him. The fear of the Lord will bring you to the heart of the Spirit of God!</p><p data-block-key=\"a4r1k\">Fourth: With whom do you sympathize? Christ is your Prince if you are able to celebrate godliness and the victories of the Lord.</p><p data-block-key=\"d9gqa\">And fifth: Have you joined the ‘troops’ that fight against the enemy-satan?  Because standing on the sidelines is NOT enough! We are needed on the front lines, not just in the Palace with the Prince. </p><p data-block-key=\"25ktc\"></p>", "2022-08-07T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/peace-prince.jpeg"], ["Follow Me as I Follow Christ", "<p data-block-key=\"gqjn4\">But evil men and impostors will grow worse and worse, deceiving and being deceived. 14) But you must continue in the things which you have learned and been assured of, knowing from whom you have learned them. 2 Tim. 3:13-14</p><p data-block-key=\"7qifg\">The Apostle Paul, mentoring Timothy, is speaking to him and encouraging him to continue in what he has learned. Remembering that Paul said &quot;follow me as I follow Christ.&quot;</p><p data-block-key=\"1jh3c\">That is what we must do! We move forward and set an example that will embolden those who watch our lives. That’s what our faith must be!</p>", "2022-08-14T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/follow.jpg"], ["Celebrating 50 Years", "<p data-block-key=\"7js62\">For I know the thoughts that I think toward you, says the Lord, thoughts of peace and not of evil, to give you a future and a hope. Jeremiah 29:11</p><p data-block-key=\"34csv\">1972-2022</p><p data-block-key=\"1p26i\">Our reflection on this observance of 50 years is one that looks back with thankfulness and looks forward with hope! Thankful for the original vision to plant a church in the Canyon Lake area, and thankful for pastors who kept the vision going. Hopeful to continue with the vision: the Great Commission! </p><p data-block-key=\"fsqcl\">Indeed, we have a history and a future! May we embrace our future with everything in us, work to complete the Great Commission; and when it’s all said and done, know that we “left it all on the field”, that we gave our all to His work; and may God be glorified!</p>", "2022-08-28T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/50.jpeg"], ["God's Plan", "<p data-block-key=\"lcswa\">Then the word of the Lord came to me, saying: Before I formed you in the womb, I knew you; before you were born, I sanctified you; I ordained you a prophet to the nations. Jeremiah 14-5</p><p data-block-key=\"cvac0\"><b>Additional Reflection 1972-2022</b></p><p data-block-key=\"726f\">In the video Brother Summers sent us, he mentioned that the district inaugurated this church in August of 1972. </p><p data-block-key=\"5rbfg\">It was that summer, in a children’s home in San Antonio, Texas, that I knelt beside a baseball field and gave my heart to the Lord. Forty-eight years before He would call me to continue the work started here that day and serve this church. That’s our God!</p>", "2022-09-04T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/godsplan.jpeg"], ["Wisdom", "<p data-block-key=\"a7d94\">But the wisdom that is from above is…  James 3:17(a)</p><p data-block-key=\"8l8uq\">When Solomon prayed to God, the Lord responded, “What shall I give you?” Wisely, Solomon asked for wisdom!  1 King 3:5 </p><p data-block-key=\"bouli\">The Lord reminds us that if we lack wisdom; all we need to do is ask Him, and He will give it to us. Solomon was wise enough to ask? May we be just as wise: Lord, help us! </p>", "2022-09-12T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/wisdom2.jpg"], ["Stewardship", "<p data-block-key=\"i696w\">Moreover, it is required in stewards that one be found faithful. 1 Cor. 4:2</p><p data-block-key=\"69n74\">Our children grew up in Central Africa, among the Bantu tribal family. They have a proverb that says, “When there is more than enough, more than enough is wasted.” </p><p data-block-key=\"hf4u\">This proverb recognizes that there is a need for stewardship; a need to be faithful with what one has been given! Indeed, this is what the Lord asks from us, that having knowledge of the principles of tithes and offerings, that we put them into practice. </p>", "2022-09-18T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/DMT_Stewards-in-Action_1-scaled.jpg"], ["Praise the Lord", "<p data-block-key=\"csn6b\">Psalm 100:1-5 NKJV</p><p data-block-key=\"co46c\">1) Make a joyful shout to the Lord, all you lands! 2) Serve the Lord with gladness;​ Come before His presence with singing.​ 3) Know that the Lord, He is God; It is He who has made us, and not we ourselves;​We are His people and the sheep of His pasture. 4) Enter into His gates with thanksgiving, And into His courts with praise. Be thankful to Him, and bless His name. 5) For the Lord is good; His mercy is everlasting, And His truth endures to all generations.</p><p data-block-key=\"13q7r\">Today, after service and our meal, we will have an old-fashioned sing along: you don&#x27;t want to miss it. Everyone is welcome! </p>", "2022-09-26T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/ptl.jpg"], ["Knowing Him", "<p data-block-key=\"xhcev\">You prepare a table before me in the presence of my enemies; you anoint my head with oil; my cup runs over. Psalm 23:5</p><p data-block-key=\"dctvi\">The fifth verse of best-known Psalm in the world reminds us that God is the One who prepares for us! Like sheep, we “go astray” and like sheep we tend to consume everything, even if it is harmful. Yes, the enemy may be close, still our task is to stay even closer to Christ, where we find refuge and safety!</p><p data-block-key=\"25arr\">Remember that our cups will never be full and running over outside of our relationship with Christ. There is no substitute for KNOWING Him!</p>", "2022-10-14T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/KnowingGodS.jpg"], ["Choose Life", "<p data-block-key=\"201ts\">Satan speaking to Christ says, “All these things I will give You if You will fall down and worship me.” Matthew 4:9 </p><p data-block-key=\"5c7c1\">Here we find the one who tried to overthrow the Creator of the Universe, and after his fall he made the decision, as John Milton writes: “Better to reign in hell than serve in heaven.”</p><p data-block-key=\"a09s6\">Truth be told, Satan had nothing to offer Christ that was of any value in eternity, and nor does he possess anything that will edify your life!</p><p data-block-key=\"8togg\">The choice is yours, choose life!</p>", "2022-11-06T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/life.jpg"], ["Crumbs in the Carpet", "<p data-block-key=\"os9ti\">You do not have because you do not ask. James 4:2 </p><p data-block-key=\"bv69b\">Brother Tenney openly declares that we don’t have the full presence of God because we don’t ask! He writes “Compared to what God wants to do, we’re digging for crumbs in the carpet when He has hot loaves baking in the ovens of heaven! He is not the God of crumbs and lack. He is waiting just to dispense unending loaves of His life-giving presence,…” </p><p data-block-key=\"1b63i\">We do not have to beg, but we do need to seek His face; we need to seek the One who is able to open the windows of heaven for us!</p>", "2022-11-28T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/breadcrumbs.jpg"], ["Waiting in Prayer", "<p data-block-key=\"hmh3b\">But those who wait on the Lord​ shall renew their strength; they mount up with wings like eagles, they shall run and not be weary, they shall walk and not faint. Isaiah 40:31</p><p data-block-key=\"t9bd\">When you understand the value of being in His presence, you will want to wait more and more on the Lord! A consistent prayer life is extremely valuable. Learn to linger in His presence!</p><p data-block-key=\"erl5v\">Jesus asked His inner circle if they could not wait an hour? They were supposed to be praying, but they were asleep. Today, many are sleeping who need to be praying! </p>", "2022-12-04T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/XHldCvUNmDGlG3R4Sy0df6i0ku0C5ghsIRdYPGsS.jpeg"], ["The Gift", "<p data-block-key=\"dmbs3\"><i>Every good gift and every perfect gift is from above, and comes down from the Father of lights… James 1:17</i></p><p data-block-key=\"92u9r\">RAPPER POEM:<br/>Shop till you drop, if you’re in the mood;<br/>Remember your manners, be a cool dude.<br/>Have fun buying gifts, for friends and family; remember the season, and keep it merrily.<br/>Nothing like the moment, when you begin to feel; the spirit of the season, it all becomes surreal.<br/>It’s not about the gifts, and it’s not about the giving; but the One who gave THE GIFT, who makes it all worth living!</p>", "2022-12-18T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/gift-844330_1920.jpg"], ["The Wisdom of Christmas", "<p data-block-key=\"206y1\">…wise men from the East came to Jerusalem, saying ‘Where is He’? Matthew 2:1-2 </p><p data-block-key=\"8bcqi\">From that day until now, wise men continue to ask ‘where is He’? Wise men still seek Him! And He can and will be found by those who truly seek Him with a whole heart! </p><p data-block-key=\"di8nu\">He reveals Himself to us in so many ways! In the heavens – the many stars and our universe! In life – new born babies! In the beauty around us – creation is a demonstration of his handiwork that no one can deny any more than one would say that a Coocoo clock evolved from a tree: No, it had a creator, just as we do. </p>", "2022-12-25T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Photo_Art_3_Wise_Men.jpg"], ["More of You, Less of Me", "<p data-block-key=\"kqysm\">He must increase, but I must decrease. John 3:30</p><p data-block-key=\"caj3o\">In this new year, we have a great opportunity to leave behind the garbage (the things that weigh us down) in the past. John the Baptist expressed it a lot like this: “He must increase, but I must decrease.”  </p><p data-block-key=\"ff0nh\">Another way of saying it that there should be more of Jesus in my life, and less of me! </p><p data-block-key=\"1f3pm\">Glen Campbell expressed it well in his song Less of Me, writing “Let me be a little meeker with the brother who is weaker, think a little more of others and a little less of me.”</p>", "2023-01-01T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/More-of-You-Less-of-Me-Sermon-series-Idea.jpg"], ["People of Prayer", "<p data-block-key=\"6ranw\">The prayer of a person living right with God is something powerful to be reckoned with. The Message, James 5:16 </p><p data-block-key=\"6g9ah\">It is time for the people of God to return to being people of prayer! Just as we have read above, “prayer is something powerful to be reckoned with”!</p><p data-block-key=\"dvhop\">“Ask, and it will be given to you; seek, and you will find; knock, and it will be opened.” Matthew 7:7</p><p data-block-key=\"5r6ja\">You might ask: What is the secret? It is simple: you are the one going to the gates of heaven asking, seeking and knocking. </p>", "2023-01-08T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Black-People-Praying-Onyx-Truth-620x400.jpg"], ["Power of Prayer", "<p data-block-key=\"irf5s\">Now it came to pass, as He was praying in a certain place, when He ceased, that one of His disciples said unto Him, ‘Lord, teach us to prayer, as John also taught his disciples.’ Luke 11:1</p><p data-block-key=\"cs6jn\">We find the disciples were watching Jesus and they had come to realize that the reason for His continued power was prayer! So, they ask Him to teach them.</p><p data-block-key=\"1asgr\">Prayer is NO mystery! It is conversation with God. Talk with Him like you would speak with a friend you loved! The more time you spend with Him in prayer, the more your spiritual strength will increase. </p>", "2023-01-15T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/1328631557-power-of-prayer.jpg"], ["Bride of Christ", "<p data-block-key=\"nk60l\">Just as Christ also loved the church and gave Himself for her… Ephesians 5:25</p><p data-block-key=\"c2svo\">In this passage, we understand that the church is the ‘bride’ of Christ. And when He returns, He is looking for a bride without “spot or wrinkle”. Now, the commitment to a bride is a serious thing.</p><p data-block-key=\"a0ebf\">Oftentimes, our actions with the Lord are more like a girlfriend than a bride! We’re not on “a date”; we need to be getting ready for the Marriage Supper of The Lamb!</p>", "2023-01-22T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/JESUS-BRIDE-STAIRCASE-360x341.jpg"], ["Upward Call of God", "<p data-block-key=\"9kkx6\">I press toward the goal for the prize of the upward call of God in Christ Jesus.  Philippians 3:14</p><p data-block-key=\"b2c6m\">History seems to show us that no true revival ever happened simply because people sought revival. It took place when people sought Him! Sometimes we think we can announce a revival, and we can have ‘revival services’, but it will fall short.</p><p data-block-key=\"ds5mj\">Let us seek the Reviver, not just revival! Let us seek a closer walk with Him; let’s seek intimacy with the Almighty! And let us say “less of me and more of Him”.</p><p data-block-key=\"eslbp\"></p>", "2023-01-30T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/The-Upward-Call-Of-God.png"], ["Be Dead to Sin", "<p data-block-key=\"4ji8z\">Be dead to sin… Romans 6:11 </p><p data-block-key=\"fr605\">In my teen years I worked for the YMCA Camp in Hunt, Texas. Most of you won’t know where that is; but if you go to Kerrville, continue along the river to Ingram, you will eventually stumble upon Hunt. It was the perfect place for a summer camp. Anyway, back to the story, I worked for the camp many summers, and one particular year before the camping season began, the counselors and staff spent a full day picking up trashing and straightening things up. Well, the kids came, and camp went on as usual. And little by little the trash we had picked up returned. The thing is,  it happened so gradually that no one really noticed.  Then, one day the President of the YMCA of San Antonio came for a visit of the camp, and he was shocked! The amount of trash laying around was staggering to him, and until it was pointed out, we were blind to it! Needless to say, it got picked up again! Sometimes, we’re like that with sin in our lives! It comes in so gradually that we hardly notice, and everyone is doing it, so it’s okay, because “everyone is doing it”. But when Christ comes, He will not want to find our trashy lives; He won’t want to find us living in sin; in fact, He will not accept it! The Word of God says to “be dead to sin” (Romans 6:11), but some people aren’t even sick of it! </p>", "2023-02-12T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/trash.jpg"], ["Holy Things of God", "<p data-block-key=\"u84jn\">The Lord has blessed the house of Obed-Edom and all that belongs to him, because of the ark of God.  2 Sam. 6:12</p><p data-block-key=\"dsk38\">The ark of the covenant (or testimony) represented the presence of the Lord! God said “You shall put the mercy seat on top of the ark,… And there I will meet with you, and I will speak with you from above the mercy seat, from between the two cherubim which are on the ark of the Testimony.” Ex. 25:21-22. In the Tabernacle, the ark was to be kept inside the “Holy of Holies” or the most holy place.  </p><p data-block-key=\"4fh67\">On several occasions when the ark was moved, people died because of their failure to properly handle and reverence the presence and holiness of God!</p><p data-block-key=\"b40u2\">We need; indeed, we must learn to handle the holy things of God with greater awe, reverence and sensitivity! The veil has been removed and we have direct access with The Trinity: God the Father, God the Son and God the Holy Spirit! Let us seek the manifest glory of God with awe and respect that demonstrates the true fear of the Lord! </p>", "2023-02-19T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/908413517-ark_covenant.jpg"], ["Mercy Seat", "<p data-block-key=\"ntqk9\">But Christ came as High Priest of the good things to come, with the greater and more perfect tabernacle not made with hands, that is, not of this creation. Not with the blood of goats and calves, but with His own blood He entered the Most Holy Place once for all, having obtained eternal redemption. Hebrews 9:11-12 </p><p data-block-key=\"4rb85\">The top of the Ark of Covenant was called the Mercy Seat. It was more like a covering or a lid for the Ark on which the cherubim spread their wings covering it all. There was a veil (a thick drape), that separated the area where the Ark was; it was called the Holy of Holies.</p><p data-block-key=\"2pveb\">When Christ went to the cross, taking all our sins, He paid the price with His own blood. It was at that time that the veil was torn in two, symbolic of the access we received to &quot;meet with God&quot; (Ex. 25:22) directly, ourselves. No more veil!</p><p data-block-key=\"cvgpa\">Provision for you to have the sweetest communion with your Creator has been made available to you. What are you going to do with it?</p>", "2023-02-26T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/mercy-seat2_0.jpg"], ["Don’t go without Him!", "<p data-block-key=\"q4xf2\">Then Joshua the son of Nun called the priests and said to them, Take up the ark of the covenant, and let seven priests bear seven trumpets of rams’ horns before the ark of the Lord. 7 And he said to the people, “Proceed, and march around the city, and let him who is armed advance before the ark of the Lord.” 8 So it was, when Joshua had spoken to the people, that the seven priests bearing the seven trumpets of rams’ horns before the Lord advanced and blew the trumpets, and the ark of the covenant of the Lord followed them. 9 The armed men went before the priests who blew the trumpets, and the rear guard came after the ark, while the priests continued blowing the trumpets. 10 Now Joshua had commanded the people, saying, “You shall not shout or make any noise with your voice, nor shall a word proceed out of your mouth, until the day I say to you, ‘Shout!’ Then you shall shout.” 11 So he had the ark of the Lord circle the city, going around it once. Then they came into the camp and lodged in the camp.” Joshua 6:6-11 </p><p data-block-key=\"7m699\">The children of Israel carried the Ark of the Covenant into battle often, as the Lord directed them. Remember that it was the top of the Ark, the Mercy Seat (covering) where the Lord said He would meet with His servants. The Ark represented the presence of the Lord going with them into battle. Today, the presence of the Lord can be in our hearts and lives, going with us to face any battle we might have on any given day.  Don’t go without Him! </p>", "2023-03-05T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Follow-Jesus-OriginalWithCut-774x1376-90-CardBanner.jpeg"], ["Stay Focused, Stay Close to the Lord", "<p data-block-key=\"fpa3u\">Then Elijah said to all the people, “Come near to me.” So all the people came near to him. And he repaired the altar of the Lord that was broken down… 33 And he put the wood in order, cut the bull in pieces, and laid it on the wood,…    1 Kings 18:30,33</p><p data-block-key=\"15ouh\">There are three lessons to be learned from this passage:</p><ol><li data-block-key=\"6qil3\">Elijah realized the alter needed repair. Recognizing the condition of your altar is crucial!</li><li data-block-key=\"ggk4\">The prophet immediately began repairs. Don’t put this off until tomorrow, or another day.</li><li data-block-key=\"417cq\">He used the altar after repairing it. Take a quiet moment and use your altar (your quiet time with the Lord).   </li></ol><p data-block-key=\"92l89\">Remember to put your eyes on the Lord! Stay focused and stay close to the Lord. The signs of the times are everywhere! </p><p data-block-key=\"f9dk8\"></p>", "2023-03-12T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/keep-your-focus-on-jesus-1920.jpg"], ["The World's Goods", "<p data-block-key=\"jnrys\">Nothing is worth holding on to so hard that you can’t hold Him.   Tommy Tenney</p><p data-block-key=\"fmiaj\">Do not love the world or the things in the world…  1 John 2:15</p><p data-block-key=\"4lq3m\">It is such a strange word: THINGS! The ‘things’ in the world. The Message says “the world’s goods”. The history of storage units and mini-storage facilities in the US is interesting and startling at the same time. It is evidence of the fact that we have a difficult time letting go of our ‘things’, the world’s goods!  </p><p data-block-key=\"ftnfi\">Let us take care that we do not hold so tightly to something that we are unable to hold what is most important: Christ! Revelation 3:11 says “…hold fast what you have, that no one may take your crown.”  </p>", "2023-03-20T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/bigstock-Hoarder-room-packed-with-stora-289658842.jpg"], ["Trespass Offering", "<p data-block-key=\"tj1ix\">And he shall make restitution… Lev. 5:16</p><p data-block-key=\"ee5f2\">The first five chapters of Leviticus are extremely interesting! They deal with the five different offerings the children of Israel were to make. The Burnt offering, the Grain offering, the Peace offering, the Sin offering and the Trespass offering.</p><p data-block-key=\"bfg5b\">This final offering, the Trespass offering, shines the light on the need to make restitution. The goal is to gain a clear conscience. Jesus said, in the sermon on the mount, “If you bring your gift to the altar, and remember that a brother has something against you,…go make it right!” Matt. 5:23</p><p data-block-key=\"7cglg\">Walking in FORGIVENESS must also include restitution, when necessary. When you need to ask for forgiveness, if something was also taken, damaged, lost etc. restitution of that should happen!</p><p data-block-key=\"8ngq6\">Walking properly in forgiveness makes it easier to live in the light of eternity! </p>", "2023-03-26T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/the-offerings-burnt-offering-2-728.webp"], ["Be Silent and Listen", "<p data-block-key=\"bt5e8\">Then it shall come to pass, because you listen to these judgments, and keep and do them, that the Lord your God will keep with you the covenant and the mercy which He swore to your fathers. Deuteronomy 7:12</p><p data-block-key=\"d1ggf\">When we listen to the Lord and walk in obedience to His Word, we are rewarded with the blessings that come through a covenant fellowship. You might know that if we choose not to listen and walk in disobedience, we can expect the opposite.</p><p data-block-key=\"fhh1c\">I have said it before, but it is worth repeating: when we pray (talk with God), we would be better off shutting our mouths and listening rather than asking and complaining without end. LISTEN! Listen to Him, to His still small voice! And remember that with the same letters used to spell the word LISTEN, we may spell the word SILENT.</p><p data-block-key=\"9gbc3\">Be SILENT before the Lord, and LISTEN! </p>", "2023-04-02T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Listening01.jpg"], ["The Stone Had Been Taken Away", "<p data-block-key=\"5qhi1\">The Stone had been taken away…  John 20:1<br/></p><p data-block-key=\"a2rdo\">The journey for our redemption began in heaven. God the Son then came to earth in the form of a baby. He lived and walked among us, yet without sin. Our Messiah, Jesus, spent three and a half years teaching us about the kingdom of heaven, healing people and showing us what AGAPE – God’s kind of love – really is.</p><p data-block-key=\"93qcm\">When all was said and done, Christ went through a severe beating, stumbled to mount Calvary, was crucified and died on that cross. He took our sins - our debts that we could not pay, and they were nailed to the cross with Jesus. His blood paid the debt forever!</p><p data-block-key=\"btmbp\">He was buried in a barrowed tomb with a large stone rolled in front of it. From Friday afternoon until Sunday morning, all seemed to be lost. His disciples did not understand the prophecies or what Jesus Himself had spoken to them. They were afraid and hopeless!</p><p data-block-key=\"df3qb\">Sunday morning, however, changed everything! On Friday the Devil thought that he had won; but Sunday morning began with the stone being rolled away, and Jesus no longer in the tomb. The enemy was defeated, and the Alpha and Omega was Resurrected! He is risen! </p>", "2023-04-10T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/maxresdefault.jpg"], ["Growing in Faith", "<p data-block-key=\"1rudt\">Now faith is the substance of things hoped for, the evidence of things not seen.  Hebrews 11:1</p><p data-block-key=\"ftgqf\">Years ago, I penned these words: </p><p data-block-key=\"c1c80\">“With an open heart<br/>I receive Your Word;<br/>and with an open mind<br/>I respond.</p><p data-block-key=\"18a3t\">Each day Your letters become<br/>real to me; how I’ve grown<br/>beyond.</p><p data-block-key=\"11kc4\">Beyond my own strength,<br/>past my own limits;<br/>with the love and understanding<br/>that faith in You permits.”</p><p data-block-key=\"8l9gj\">M.G. Baumgartner, 1984</p><p data-block-key=\"fn3io\">Growing in faith with the Lord means that you will find yourself in a different place next week, next month and next year.</p>", "2023-04-17T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/grow-faith.jpg"], ["Pursue the New Life", "<p data-block-key=\"by0ww\">Pursue peace with all people, and holiness, without which no one will see the Lord… Hebrews 12:14</p><p data-block-key=\"2re3s\">The song TAKE MY LIFE says this: “Holiness, holiness is what I long for, holiness is what I need; holiness, holiness is what You want from me.”</p><p data-block-key=\"bf7im\">The chorus says: “So take my heart, and form it; take my mind, transform it; take my will, conform it; to Yours, to Yours, oh Lord.”</p><p data-block-key=\"8184q\">A sanctified life does not happen by accident. No one became holy by doing nothing! </p><p data-block-key=\"ctjsc\">When we pursue God; when we pursue His presence, we set ourselves apart for Him (sanctification), and our pursuit of the Lord causes the things of our ‘old life’ to burn up, to be consumed by the fire of the Holy Spirit. Pursue Him and walk in the newness of life! </p>", "2023-04-23T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/New-Life-Fotolia_45161515_XS.jpg"], ["Renew Your Mind", "<p data-block-key=\"9t4lr\">Romans 12:1 says, I beseech you therefore, brethren, by the mercies of God, that you present your bodies a living sacrifice, holy, acceptable to God, which is your reasonable service. 2 And do not be conformed to this world, but be transformed by the renewing of your mind, that you may prove what is that good and acceptable and perfect will of God.</p><p data-block-key=\"1gbq8\">The way in which the Lord desires us to serve is not as dead sacrifices, but rather as living!  “To live is Christ!”  In order to accomplish that goal, we must avoid being conformed to this world! In Christ, the Lamb of God, we are able to be transformed – a true renewal of our minds!</p>", "2023-05-21T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/renewing-your-mind.jpg"], ["Memorial Day", "<p data-block-key=\"z5d25\">Having eyes, do you not see? And having ears, do you not hear? And do you not remember? Mark 8:18</p><p data-block-key=\"64ci6\">Speaking of military veterans, purple heart recipient H.W. Osterkamp said, “All gave some, and some gave all.” In our congregation are many veterans, some who served during peace time and some who serve during a war; I am one of them. Yet we all came home. Today, we remember those who gave all for our freedoms, but they did not return home!  This is why we celebrate Memorial Day!</p><p data-block-key=\"73ogt\">Yet, there is Another, who is closer than a brother, He paid it all for our salvation, healing, and freedom: may we remember forever!</p><p data-block-key=\"acdvf\"></p>", "2023-05-28T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/COL_Memorial_Day_2021.png"], ["Wisdom", "<p data-block-key=\"yts3y\">20) Wisdom calls aloud outside; She raises her voice in the open squares. 21) She cries out in the chief concourses, at the openings of the gates in the city She speaks her words: 22) “How long, you simple ones, will you love simplicity? For scorners delight in their scorning, and fools hate knowledge. 23) Turn at my rebuke; surely, I will pour out my spirit on you; I will make my words known to you.” Proverbs 1:20-23</p><p data-block-key=\"fnsln\">We often fall into foolish behavior and actions when we fail to listen to Wisdom! Furthermore, it is not enough to hear it, we must also act upon it. Prudence is taking wisdom and applying it to practical matters, to everyday living. James 1:5 says, “If any of you lacks wisdom, let him ask of God…” What are you waiting for?</p>", "2023-06-05T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/8784955343_c7d2009321_b.jpg"], ["Pray for America", "<p data-block-key=\"jt8rk\">For the eyes of the Lord are on the righteous, And His ears are open to their prayers; But the face of the Lord is against those who do evil.  1 Peter 3:12</p><p data-block-key=\"anmcq\">When we lift up our voices in prayer to the Lord, His Word tells us that He sees and hears! God is listening to you!</p><p data-block-key=\"abq6v\">We are taking June 5-July 4 to pray for America! And she needs prayer! Please, make it a point to pray for the various US Missions departments, as well as the need listed for on the date in the prayer guide.</p><p data-block-key=\"55fp2\">Today we are to pray for discernment as spiritual warfare intensifies.</p>", "2023-06-11T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/Pray-for-America.jpg"], ["Freedom", "<p data-block-key=\"p1s54\">Therefore, if the Son makes you free, you shall be free indeed. John 8:36</p><p data-block-key=\"2dlcc\">When I consider the concept of Freedom, my thoughts divide into two areas: freedom in Christ, and the God given freedom that every human being should have on this planet.</p><p data-block-key=\"ab9pl\">I have lived in five different countries and visited at least twenty-eight others (perhaps forgetting one or two). Several of the places I lived, and many of the places I visited were underdeveloped third world countries. I have seen poverty at its worst. I’ve seen malnutrition, disease and ignorance take its toll! I’ve seen hopelessness and despair, and have lived among people for whom freedom was just an illusion, a fantasy, or an elusive dream.</p><p data-block-key=\"fn8al\">But all people, every nation and every tribe should be free! No one wants to be a slave: not to others, not to habits and not to things! I keep hearing that phrase from the moving La Amistad, “Give us, us free.”</p>", "2023-07-03T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/freedom.jpeg"], ["Thank you Lord!", "<p data-block-key=\"5kzzy\">Oh, give thanks to the Lord, for He is good! For His mercy endures forever. Psalms 107:1</p><p data-block-key=\"46q8p\">This verse is repeated several times in Psalms 107, in order to add emphasis, even a response from the people to remember to give thanks!</p><p data-block-key=\"3vhj2\">We need to be reminded! God wants us to remember to give thanks because that is how He created us. And we are the ones who benefit when we show our gratitude. Quite literally, when you are too blessed to be stressed, and you speak it; you acknowledge it to the Lord and others, you actually rest better and have less stress, according to scientific studies about anxiety and gratefulness.</p><p data-block-key=\"8cjpi\">So, say it with me, “Thank you Lord!”</p>", "2023-07-09T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/thank-you-lord.jpg"], ["Knowing Him", "<p data-block-key=\"mbkp0\">That I may know Him and the power of His resurrection, and the fellowship of His sufferings, being conformed to His death, 11. if, by any means, I may attain to the resurrection from the dead. Philippians 3:10-11</p><p data-block-key=\"dr9u2\">When I consider a passage that should be considered to meditate on and memorize, these verses make the list!</p><p data-block-key=\"9tc2t\">Knowing Him is our highest goal! Not the simple ‘head knowledge’, but the heart knowledge of relationship. To know about the Lord, yet not know Him as your personal Lord and Savior is exactly how people miss heaven! Think about it!</p>", "2023-07-16T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/knowing-him.jpeg"], ["Pastor's Heart", "<p data-block-key=\"7n3sf\">Let the priests, who minister to the Lord, Weep between the porch and the altar; Let them say, “Spare Your people, Oh Lord,…Why should they say among the peoples, ‘Where is their God?’ ” Joel 2:17</p><p data-block-key=\"36d0e\">Perhaps the assignment I take the most serious and likely the one that weighs on my heart the most is that of crying out to God for the people. He has put under my shepherd’s staff: the weep between the porch and the altar… saying spare Your people, oh Lord is a high calling!</p><p data-block-key=\"forb4\">No, I am not going to tell you what you ‘want’ to hear; but I will faithfully speak God’s Word to you, and pray for you often; that’s a pastor’s heart.</p>", "2023-07-30T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/TPH-900x900-logo3.png"], ["Apocaloptimist", "<p data-block-key=\"piy6b\">For the Lord Himself will descend from heaven with a shout, with the voice of an archangel, and with the trumpet of God. And the dead in Christ will rise first.</p><p data-block-key=\"25q4c\">1 Thessalonians 4:16</p><p data-block-key=\"bgll6\">The other day I came across the funniest of words: APOCALOPTIMIST. A made-up word from Apocalypse and Optimist. The definition provided was “Someone who knows that the world is going towards hell and destruction, but still thinks it will turn out okay.”</p><p data-block-key=\"41b2c\">For those who truly walk in Christ, who live in the Spirit, it will end well. For us, the absence from the body is to be present with the Lord. Now, for those who are not in Christ, not living right, not walking in the Spirit, all the wishful thinking in the world will not make it end well. Take a quiet moment and think on this!</p>", "2023-08-08T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/AE_Datebook_Preparathon_THINKSTOCK_rp0818.jpg"], ["Prudence", "<p data-block-key=\"5romw\">I, wisdom, dwell with prudence, and find out knowledge and discretion. 13 The fear of the Lord is to hate evil; pride and arrogance and the evil way and the perverse mouth I hate. 14 Counsel is mine, and sound wisdom; I am understanding, I have strength. 15 By me kings reign, and rulers decree justice. 16 By me princes rule, and nobles, all the judges of the earth. 17 I love those who love me, and those who seek me diligently will find me. 18 Riches and honor are with me, enduring riches and righteousness. 19 My fruit is better than gold, yes, than fine gold, and my revenue than choice silver.</p><p data-block-key=\"6pank\">Proverbs 8:12-19</p><p data-block-key=\"blvt2\">The daily devotional is of great value when you consider that we can discover the gold and silver of wisdom, and the Lord offers us the possibility of taking that wisdom and applying it to our lives (that is prudence).</p>", "2023-08-21T00:00:00+00:00", "https://sfo3.digitaloceanspaces.com/wildwoodchurch/original_images/prudencecognition-and-decision.jpg"]]